игра 'Умный хомяк'

-игровое поле
-хомяк
-кошка
-буквы
-надпись GAME OVER 
-надпись ПОБЕДА


-игровое поле

    -фон рисунок png 
    -размер 400*1200 px
    -статичное

-хомяк

    -рисунок png 
    -размер 40*40 px
    -двигается при съедании буквы на 40 px вправо (когда игрок нажимает на нужную клавишу)
    -исчезает, когда имеет пересекающиеся координаты с кошкой

-кошка

    -рисунок png 
    -размер 80*40 px
    -двигается постоянно на 2 px в секунду

-буквы

    -26 символов латинского алфавита в нижнем регистре
    -размер 20 px Arial 
    -цвет черный
    -каждая на прозрачном поле 40*40 px 
    -выводятся в рандомном порядке
    -исчезают при нажатии на соответствующую клавишу на клавиатуре

-надпись GAME OVER 

    -размер 50 px Arial  
    -цвет красный
    -выводится на поле, если кошка съела хомяка
    -игра останавливается

-надпись ПОБЕДА

    -размер 50 px Arial 
    -цвет желтый
    -выводится на поле, если хомяк съел все буквы
    -игра останавливается